RemkoPr/airo-nrf52840-boards/boards.txt
iocoupling.name=IO_Coupling
iocoupling.build.core=arduino
iocoupling.build.crossprefix=arm-none-eabi-
iocoupling.build.compiler_path={runtime.tools.arm-none-eabi-gcc-7-2017q4.path}/bin/
iocoupling.build.variant=IO_COUPLING
iocoupling.build.mcu=cortex-m4
iocoupling.build.extra_flags=
iocoupling.build.architecture=cortex-m4
iocoupling.build.fpu=-mfpu=fpv4-sp-d16
iocoupling.build.float-abi=-mfloat-abi=softfp
iocoupling.build.board=IO_COUPLING
iocoupling.build.ldscript=linker_script.ld
iocoupling.compiler.mbed.arch.define=-DARDUINO_ARCH_NRF52840
iocoupling.compiler.mbed.defines={build.variant.path}/defines.txt
iocoupling.compiler.mbed.ldflags={build.variant.path}/ldflags.txt
iocoupling.compiler.mbed.cflags={build.variant.path}/cflags.txt
iocoupling.compiler.mbed.cxxflags={build.variant.path}/cxxflags.txt
iocoupling.compiler.mbed.includes={build.variant.path}/includes.txt
iocoupling.compiler.mbed.extra_ldflags=-lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
iocoupling.compiler.mbed="{build.variant.path}/libs/libmbed.a" "{build.variant.path}/libs/libcc_310_core.a" "{build.variant.path}/libs/libcc_310_ext.a" "{build.variant.path}/libs/libcc_310_trng.a"
iocoupling.vid.0=0x2341
iocoupling.pid.0=0x005a
iocoupling.vid.1=0x2341
iocoupling.pid.1=0x805a
iocoupling.vid.2=0x2341
iocoupling.pid.2=0x015a
iocoupling.vid.3=0x2341
iocoupling.pid.3=0x025a
iocoupling.upload_port.0.vid=0x2341
iocoupling.upload_port.0.pid=0x005a
iocoupling.upload_port.1.vid=0x2341
iocoupling.upload_port.1.pid=0x805a
iocoupling.upload_port.2.vid=0x2341
iocoupling.upload_port.2.pid=0x015a
iocoupling.upload_port.3.vid=0x2341
iocoupling.upload_port.3.pid=0x025a
iocoupling.upload.tool=bossac
iocoupling.upload.tool.default=bossac
iocoupling.upload.protocol=
iocoupling.upload.transport=
iocoupling.upload.use_1200bps_touch=true
iocoupling.upload.wait_for_upload_port=true
iocoupling.upload.native_usb=true
iocoupling.upload.maximum_size=983040
iocoupling.upload.maximum_data_size=262144
iocoupling.bootloader.tool=openocd
iocoupling.bootloader.tool.default=openocd
iocoupling.bootloader.extra_action.preflash=echo INFO:removed_mass-erase
iocoupling.bootloader.config=-f target/nrf52.cfg
iocoupling.bootloader.programmer=-f interface/cmsis-dap.cfg
iocoupling.bootloader.file=nano33ble/bootloader.hex
